/******************** (C) COPYRIGHT 2011 野火嵌入式开发工作室 ********************
 * 文件名       ：startup.h
 * 描述         ：CPU启动相关函数的头文件
 * 备注         ：
 *
 * 实验平台     ：野火kinetis开发板
 * 库版本       ：
 * 嵌入系统     ：
 *
 * 作者         ：
 * 淘宝店       ：http://firestm32.taobao.com
 * 技术支持论坛 ：http://www.ourdev.cn/bbs/bbs_list.jsp?bbs_id=1008
**********************************************************************************/


#ifndef _STARTUP_H_
#define _STARTUP_H_

/********************************************************************/

void common_startup(void);

/********************************************************************/

#endif /* _STARTUP_H_ */
