/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2017,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：179029047
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file       		misc
 * @company	   		成都逐飞科技有限公司
 * @author     		逐飞科技(QQ3184284598)
 * @version    		v2.0
 * @Software 		IAR 7.7 or MDK 5.23
 * @Target core		S9KEA128AMLK
 * @Taobao   		https://seekfree.taobao.com/
 * @date       		2017-11-6
 ********************************************************************************************************************/



#include "misc.h"



//-------------------------------------------------------------------------------------------------------------------
//  @brief      设置中断向量表地址
//  @param      vtor            新的中断向量表地址
//  @return     void
//  @since      v1.0
//  Sample usage:               write_vtor(0x1fff0000);;  
//-------------------------------------------------------------------------------------------------------------------
void write_vtor (int vtor)
{
    // Write the VTOR with the new value
    SCB->VTOR = vtor;
}


