/******************** (C) COPYRIGHT 2011 野火嵌入式开发工作室 ********************
 * 文件名       ：isr.c
 * 描述         ：LED函数定义
 *
 * 实验平台     ：野火kinetis开发板
 * 库版本       ：
 * 嵌入系统     ：
 *
 * 作者         ：野火嵌入式开发工作室
 * 淘宝店       ：http://firestm32.taobao.com
 * 技术支持论坛 ：http://www.ourdev.cn/bbs/bbs_list.jsp?bbs_id=1008
**********************************************************************************/	


#include  "LED.H"


/*************************************************************************
*                             野火嵌入式开发工作室
*
*  函数名称：LED_init
*  功能说明：初始化LED端口，设置IO口为输出方向
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-2   已测试
*  备    注：
*************************************************************************/
void    LED_init(void)
{
    gpio_init(LED_PORT,LED0,GPO,LED_OFF);
    gpio_init(LED_PORT,LED1,GPO,LED_OFF);
    gpio_init(LED_PORT,LED2,GPO,LED_OFF);
    gpio_init(LED_PORT,LED3,GPO,LED_OFF);
}

/*************************************************************************
*                             野火嵌入式开发工作室
*
*  函数名称：led
*  功能说明：设置LED灯亮灭
*  参数说明：LEDn        LED端口（LED0、LED1、LED2、LED3）
*            status      LED状态（LED_ON、LED_OFF）
*  函数返回：无
*  修改时间：2012-2-2   已测试
*  备    注：
*************************************************************************/
void    led(LEDn ledn,LED_status status)
{
    GPIO_SET_1bit(LED_PORT,ledn,status);
}

void LED_turn(LEDn ledn)
{
    LED_TURN(ledn);
}

/*************************************************************************
*                             野火嵌入式开发工作室
*
*  函数名称：water_lights
*  功能说明：四个LED轮流闪烁，流水灯
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-10   已测试
*  备    注：
*************************************************************************/
void water_lights(void)
{

    LEDn    n;
    LED_INIT();
    for(n=LED0;n<=LED3;n++)
    {
        led(n,LED_ON);
        LED_DELAY_MS(100);
        led(n,LED_OFF);
    }
}


/*************************************************************************
*                             野火嵌入式开发工作室
*
*  函数名称：LED_test
*  功能说明：LED测试函数，用于测试LED库里的函数是否正常
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-10
*  备    注：
*************************************************************************/
void  LED_test(void)
{
    LED_INIT();
    while(1)
    {
        LED_DELAY_MS(500);
        LED(LED0,LED_ON);
        LED_DELAY_MS(500);
        LED(LED0,LED_OFF);
    }
}








