/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2017,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：179029047
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file       		system
 * @company	   		成都逐飞科技有限公司
 * @author     		逐飞科技(QQ3184284598)
 * @version    		v2.0
 * @Software 		IAR 7.7 or MDK 5.23
 * @Target core		S9KEA128AMLK
 * @Taobao   		https://seekfree.taobao.com/
 * @date       		2017-11-6
 ********************************************************************************************************************/

#ifndef SYSTEM_SKEAZ1284_H_
#define SYSTEM_SKEAZ1284_H_                      

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

//-------------------------------------------------------------------------------------------------------------------
//  KEA128_CLOCK 为 0  内核频率 40M  总线频率20M   定时器频率40M  使用外部晶振
//  KEA128_CLOCK 为 1  内核频率 80M  总线频率40M   定时器频率80M  使用外部晶振 不一定所有的单片机都能超频到80M
//  KEA128_CLOCK 为 2  内核频率 48M  总线频率24M   定时器频率48M  使用内部晶振
//-------------------------------------------------------------------------------------------------------------------
#define KEA128_CLOCK    2
    
void Start (void);


#ifdef __cplusplus
}
#endif

#endif  
